~Cases/HeatTransfer/cht_SS_PipeFlow/0.orig/fluid_0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.002;

    boundaryField
    {
        "inlet"
        {
            type            fixedValue;
            value           $internalField;
        }
		
		"outlet"
        {
            type            zeroGradient;
        }

		"fluid_0-solid"
		{
        type                kqRWallFunction;
		value			    $internalField;
		}

        "proc.*"
        {
            type            processor;
        }

	}



// ************************************************************************* //
