~Cases/HeatTransfer/cht_SS_PipeFlow/0.orig/fluid_0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5.7;

    boundaryField
    {
        "inlet"
        {
        	type            fixedValue;
			value		$internalField;
        }	
		
		"outlet"
		{
        	type            inletOutlet;
        	inletValue      $internalField;
        	value           $internalField;
		}
		
		"fluid_0-solid"
		{
        	type            omegaWallFunction;
			value			$internalField;
		}

        "proc.*"
        {
            type            processor;
        }	
		
    }


// ************************************************************************* //
